# Дана строка. Сохранить в ней только первые вхождения символов,
# удалив все остальные. Результат вывести в виде кортежа.

s ="spameggs"
list=s[0:3]
print(list)
tuple1=tuple(list)
print(tuple1)

