# Дано 2 множества, содержащих названия IT-компаний.
# Найти только те компании, которые содержатся в обоих множествах.

users={"Epam","Softeq","Edality","Ip-Net","WannaPlay","RichBrains"}
users2={"WannaPlay","Synesis","Ip-Net","RichBrains","Softeq","Company НoD",}
print(users&users2)

